Autodesk.Revit.DB.SketchEditScope.IsSketchEditingSupportedForSketchBasedElement(Autodesk.Revit.DB.ElementId)
Checks whether the element supports sketch editing.
Remarks:
This method checks if the element supports edit to all its sketches.
If you want to check if this element supports edit to a particular sketch please use Autodesk.Revit.DB.SketchEditScope.IsSketchEditingSupported(Autodesk.Revit.DB.ElementId).
elemId:
The element id to be checked.
Returns:
True if element supports sketch editing, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.SketchEditScope.IsElementWithoutSketch(Autodesk.Revit.DB.ElementId)
Validates if an element can have a sketch but currently does not.
elementId:
The element id to be checked.
Returns:
True if the element doesn't have a sketch, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.SketchEditScope.IsSketchEditingSupported(Autodesk.Revit.DB.ElementId)
Checks whether sketch can be edited.
Remarks:
This method checks if this particular sketch can be edited.
If you want to check if all sketches of an element can be edited please use Autodesk.Revit.DB.SketchEditScope.IsSketchEditingSupportedForSketchBasedElement(Autodesk.Revit.DB.ElementId)
sketchId:
The element id of sketch.
Returns:
True if sketch can be edited, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.SketchEditScope.StartWithNewSketch(Autodesk.Revit.DB.ElementId)
Starts a sketch edit mode for an element which, at this moment, doesn't have a sketch.
Remarks:
Some surface Revit elements (like some Walls or some Analytical Elements) does not have a valid sketch all the time so in order to edit them, we have to create a valid sketch first.
The application will need to start a transaction to actually make changes to the element.
SketchEditScope can only be started when there is no transaction active, thus it does not
work for commands running in automatic transaction mode.
elementId:
The Element without sketch to be edited.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId elementId already has a sketch defined.
-or-
Element does not support sketch editing.
-or-
Failed to start the sketch edit mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This SketchEditScope is not permitted to start at this moment for one of the following possible reasons:
The document is in read-only state, or the document is currently modifiable,
or there already is another edit mode active in the document.
-or-
Cannot create sketch.
Since:
2023

Autodesk.Revit.DB.SketchEditScope.Start(Autodesk.Revit.DB.ElementId)
Starts a sketch edit mode.
Remarks:
The application will need to start a transaction to actually make changes to the Sketch element.
SketchEditScope can only be started when there is no transaction active, thus it does not
work for commands running in automatic transaction mode.
sketchId:
The Sketch element to be edited.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId sketchId does not represent a Sketch.
-or-
Sketch does not support editing.
-or-
Failed to start the sketch edit mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This SketchEditScope is not permitted to start at this moment for one of the following possible reasons:
The document is in read-only state, or the document is currently modifiable,
or there already is another edit mode active in the document.
Since:
2022

Autodesk.Revit.DB.SketchEditScope.#ctor(Autodesk.Revit.DB.Document,System.String)
Instantiates a SketchEditScope object.
document:
The document for which this SketchEditScope is going to be used.
transactionName:
The name that will appear in the Undo menu in Revit after the SketchEditScope is successfully committed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a primary document, it is a linked document.
-or-
document is not a project document.
-or-
transactionName is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.SketchEditScope
A SketchEditScope allows an application to create and maintain an editing session for a Sketch.
Remarks:
Start/end of a SketchEditScope will start/end a transaction group. After a SketchEditScope is started, an application can start transactions and edit the sketch.
Individual transactions the application creates inside SketchEditScope will not appear in the undo menu.
All transactions committed during the edit mode will be merged into a single one which will bear the given name passed into SketchEditScope constructor.
Since:
2022